# Altair graphics

[Altair](https://altair-viz.github.io/) is based on [Vega](https://vega.github.io/vega/) which is named after the [Summer Triangle](https://en.wikipedia.org/wiki/Summer_Triangle).

Reference materials:

* https://altair-viz.github.io/gallery/index.html
* https://altair-viz.github.io/user_guide/saving_charts.html

In [3]:
# !pip install altair

In [4]:
import pandas as pd
import altair as alt

# Scatters/bars (countries)

In [5]:
df = pd.read_csv("countries.csv")
df.head()

,country,continent,gdp_per_capita,life_expectancy,population
0,Afghanistan,Asia,663,54.863,22856302
1,Albania,Europe,4195,74.200,3071856
2,Algeria,Africa,5098,68.963,30533827
3,Angola,Africa,2446,45.234,13926373
4,Antigua and Barbuda,N. America,12738,73.544,77656

# Lines/areas (Electricity)

We'll need to reshape our dataset to make it work! We need **one measurement per row**.

In [170]:
df = pd.read_csv("electricity.csv")
df.head()

         year  Fossil Fuels  Nuclear Energy  Renewables
0  2001-01-01         35361            3853        1437
1  2002-01-01         35991            4574        1963
2  2003-01-01         36234            3988        1885
3  2004-01-01         36205            4929        2102
4  2005-01-01         36883            4538        2724

## Time transforms (Lumber prices)

See more at https://altair-viz.github.io/user_guide/transform/timeunit.html

In [176]:
df = pd.read_csv("lumber-prices-clean.csv", parse_dates=['market_date'])
df.head()

   price market_date
0  407.0  1996-12-09
1  426.0  1997-01-02
2  408.5  1997-02-03
3  386.0  1997-03-03
4  378.0  1997-04-01

# Aggregates, sorting, stacking and more

In [48]:
df = pd.read_csv("countries.csv")
df.head()

,country,continent,gdp_per_capita,life_expectancy,population
0,Afghanistan,Asia,663,54.863,22856302
1,Albania,Europe,4195,74.200,3071856
2,Algeria,Africa,5098,68.963,30533827
3,Angola,Africa,2446,45.234,13926373
4,Antigua and Barbuda,N. America,12738,73.544,77656

# Layered charts

In [194]:
df = pd.read_csv("countries.csv")
df.head()

,country,continent,gdp_per_capita,life_expectancy,population
0,Afghanistan,Asia,663,54.863,22856302
1,Albania,Europe,4195,74.200,3071856
2,Algeria,Africa,5098,68.963,30533827
3,Angola,Africa,2446,45.234,13926373
4,Antigua and Barbuda,N. America,12738,73.544,77656